<template lang="pug">
.agreement
  .title 隐私政策
  .article
    p 生效日期：2020年10月30日
    p 提示
    p 本隐私政策适用于北京无问文化传播有限公司（以下简称我公司）提供的爱短剧的产品及服务。本隐私政策中爱短剧的客户端软件可能会涉及不同应用版本，用户需选择与所安装手机相匹配的软件版本，不同版本的爱短剧所提供的功能和服务可能有所不同。
    p 我公司深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我公司致力于维持您对我公司的信任，恪守以下原则保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我公司承诺，我公司将按业界成熟的安全标准采取相应的安全保护措施来保护您的个人信息。
    p 为了更好的保护您的个人信息，建议您仔细阅读更新后的隐私政策。如您对本隐私政策条款有任何异议或疑问，您可通过本隐私政策第九条公布的联系方式与我公司联系。
  .article
    p 目录
    p 一、我公司如何收集和使用您的个人信息
    p 二、我公司如何使用Cookie和同类技术
    p 三、我公司如何共享、转让、公开披露您的个人信息
    p 四、我公司如何保护您的个人信息
    p 五、您的个人信息如何在全球范围转移
    p 六、本隐私政策如何更新
    p 七、如何联系我公司
    p 八、争议解决
  .article
    p 一、我公司如何收集和使用您的个人信息
    p 1、我公司如何收集和使用您的个人信息
    p （1）个性化推荐
    p 为了向您进行个性化视频以及个性化广告的推荐、为您推荐更适合的定制化服务，我公司收集您观看视频兴趣偏好、观看记录、观看时长、点击数据等及您的设备标识信息【本隐私政策的“设备标识信息”包括硬件型号、操作系统版本号/类型、唯一设备识别码（ IMEI/Android ID/IDFA/OpenUDID/GUID/SIM 卡 IMSI 信息等）、设备MAC地址、IP地址、软件版本号、网络接入方式及类型)】。当您开启设备定位功能，我公司还会收集您的地理位置信息，包括精准定位信息。您可以通过系统设置关闭定位功能的授权，以停止我公司收集您的位置信息，但这可能会导致无法达到相关服务预期达到的使用效果。
    p （2）产品适配
    p 为了爱短剧产品可以适配您的设备，我公司会向您收集唯一设备标识别码、操作系统名称和版本。
    p 2、您理解并同意，以下情形中，我公司收集、使用您的个人信息不必另行征得您的授权同意：
    p 1) 我公司履行法律法规规定的义务相关的；
    p 2) 与国家安全、国防安全直接相关的；
    p 3) 与公共安全、公共卫生、重大公共利益直接相关的；
    p 4) 与刑事侦查、起诉、审判和判决执行等直接相关的；
    p 5) 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您授权同意的；
    p 6) 所涉及的您的信息是您自行向社会公众公开的；
    p 7) 根据您要求签订和履行合同所必需的；
    p 8) 从合法公开披露的信息中收集您的个人信息的，如合法的新闻报道、政府信息公开等渠道；
    p 9) 维护所提供我公司爱短剧产品或服务的安全稳定运行所必需的，如发现、处置产品或服务的故障；
    p 10）法律法规等规定的其他情形。
  .article
    p 二、我公司如何使用Cookie和同类技术
    p 为了收集前述个人信息，我公司和第三方授权合作伙伴均可能使用技术，通过理解和记忆您的特定使用偏好使用以下技术，为您提供更加个性化的体验：
    p 1、Cookie：为确保爱短剧正常运转，我公司会在您的移动设备上存储名为Cookie的小数据文件。Cookie通常包含标识符、站点名称以及一些号码和字符。借助于Cookie，网站能够存储您的偏好等数据。我公司不会将Cookie用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookie。
    p 2、SDK：SDK是我公司嵌入爱短剧的一组工具和/或代码，允许第三方授权合作伙伴收集有关用户如何与服务交互的信息；
  .article
    p 三、我公司如何共享、转让、公开披露您的个人信息
    p 1、共享
    p 我公司不会与我公司以外的任何公司、组织和个人分享您的个人信息，但以下情况除外：
    p （1）事先已获得您的明确授权或同意；
    p （2）根据适用的法律法规、法律程序、政府的强制命令或司法裁定而需共享您的个人信息；
    p （3）在法律要求或允许的范围内，为了保护爱短剧及其用户或社会公众的利益、财产或安全免遭损害而有必要提供您的个人信息给第三方；
    p （4）您的个人信息可能会在我公司关联公司之间共享。我公司只会共享必要的个人信息，且这种共享亦受本隐私政策声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意；
    p （5）为实现本隐私政策中声明的目的，我公司的某些服务将由授权合作伙伴提供。我公司可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我公司仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我公司的合作伙伴无权将共享的个人信息用于任何其他用途。如果您拒绝我公司的合作伙伴在提供服务时收集为提供服务所必需的个人信息，将可能导致您无法在爱短剧中使用该第三方服务。我公司的授权合作伙伴包括以下类型：
    p 第三方SDK类服务商：为向您推荐更适合您的服务，我公司的产品和服务可能包括第三方的产品和服务，以及第三方网站的链接。当您使用这些产品或服务时，也可能收集您的信息。目前我公司接入的第三方SDK如下：
  .table
    .t_line
      .th.td 序号
      .th.td SDK名称
      .th.td 场景描述
      .th.td 个人信息字段
      .th.td 隐私政策链接
      .th.td 第三方SDK名称
    .t_line
      .td 1
      .td 友盟SDK
      .td 统计分析
      .td 设备标识信息、设备MAC地址、每次使用产品的时长
      .td https://www.umeng.com/policy
      .td 友盟同欣（北京）科技有限公司
    .t_line
      .td 2
      .td 数盟
      .td 移动设备性识别及反欺诈技术方案
      .td 设备标识信息、设备MAC地址、每次使用产品的时长
      .td https://www.shuzilm.cn/privacy.html
      .td 北京数字联盟网络科技有限公司
  .article
    p 为了最大程度保障您的信息安全，我公司建议您在使用第三方SDK服务前先行查看其隐私条款。如果您最不希望其个人信息处理和使用，您可以登录网址第三方SDK网站进行退出操作。
    p 对我公司与之共享个人信息的公司、组织和个人，我公司会与其签署严格的保密协定，要求他们按照我公司的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。
    p 2、转让
    p 我公司不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
    p （1）获得您的明确同意后，我公司会向其他方转让您的个人信息；
    p （2）在涉及合并、收购或破产清算时，如涉及到个人信息转让，我公司会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我公司将要求该公司、组织重新向您征求授权同意。
    p 3、公开披露
    p 我公司仅会在以下情况下，公开披露您的个人信息：
    p （1）获得您明确同意后；
    p （2）基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我公司可能会公开披露您的个人信息。
  .article
    p 四、我公司如何保护您的个人信息
    p 1、我公司已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我公司会采取一切合理可行的措施，保护您的个人信息。例如我公司使用加密技术确保数据的保密性；我公司会使用受信赖的保护机制防止数据遭到恶意攻击；我公司会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我公司会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
    p 2、我公司在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内，不会进行任何数据出境。您的个人信息存储期限为10年；10年期满后如您继续在使用爱短剧服务的，该等服务必需的个人信息的存储期限再续10年，如届时您已经不再使用爱短剧服务的，我公司将及时删除您的个人信息。
    p 3、互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我公司强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我公司保证您的帐号安全。
    p 4、互联网环境并非百分之百安全，我公司将尽力确保或担保您发送给我公司的任何信息的安全性。如果我公司的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我公司将承担相应的法律责任。
    p 5、在不幸发生个人信息安全事件后，我公司将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我公司已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我公司将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我公司会采取合理、有效的方式发布公告。
    p 同时，我公司还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
  .article
    p 五、您的个人信息如何在全球范围转移
    p 目前我公司不会跨境传输或存储您的个人信息。将来如需跨境传输或存储的，我公司会向您告知信息出境的目的、接收方、安全保障措施和安全风险，并征得您的同意。
  .article
    p 六、本隐私政策如何更新
    p 我公司的隐私政策可能变更。未经您明确同意，我公司不会削减您按照本隐私政策所应享有的权利。我公司会在本页面上发布对本隐私政策所做的任何变更。对于重大变更，我公司还会提供更为显著的通知。本隐私政策所指的重大变更包括但不限于：
    p 1、我公司的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
    p 2、我公司在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
    p 3、个人信息共享、转让或公开披露的主要对象发生变化；
    p 4、您参与个人信息处理方面的权利及其行使方式发生重大变化；
    p 5、我公司负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
    p 6、个人信息安全影响评估报告表明存在高风险时。
    p 我公司还会将本隐私政策的旧版本存档，供您查阅。
  .article
    p 七、如何联系我公司
    p 如您对本隐私政策有任何疑问、意见或建议，您可以通过如下方式与我公司联系。一般情况下，我公司将在15个工作日内回复您。
    p 电子邮件：kefu@bayread.com
    p 电 话：15810941216
  .article
    p 八、争议解决
    p 因本隐私政策产生的及与本隐私政策相关的任何争议，应提交我公司所在地有管辖权的法院诉讼解决。
</template>

<script>
export default {
  data() {
    return {}
  },
  methods: {},
  mounted() {},
}
</script>

<style lang="stylus" rel="stylesheet/stylus">
@import '../../styles/index.styl';
.agreement
  padding 10px 20px
  .title
    font-size 20px
    padding 15px 0
    line-height 28px
    color #3b8dd1
    font-weight 600
    border-bottom 1px solid #f0f0f0
    margin-bottom 15px
  .article
    font-size 14px
    white-space pre-wrap
    line-height 1.6
    margin-bottom 20px
    p
      line-height 1.6
  .table
    font-size 14px
    .t_line
      display flex
      &:first-of-type
        .td
          border-top-width 1px
      .td
        width 80px
        white-space pre-wrap
        word-break break-all
        border 1px solid #333333
        border-left-width 0
        padding 0 2px
        border-top-width 0
        &:first-of-type
          border-left-width 1px
      .th
        text-align left
</style>
