<template lang="pug">
.agreement
  .title 红桃免费小说软件用户协议
  .article 红桃免费小说软件用户协议（以下简称“本协议”）是北京指尖阅读科技有限公司（以下简称“指尖阅读”）与您就 “红桃免费小说”软件（以下简称“红桃免费小说”或“本软件”）的安装及使用等相关事项所订立的有效合约。您通过点击确认本协议或以其他方式选择接受本协议，即表示您已与指尖阅读达成协议并同意接受本协议的全部如下约定内容。
  .article 一、请务必认真阅读和理解本协议中规定的所有权利和限制。您一旦安装、复制、下载、访问或以其它方式使用红桃免费小说产品，将视为对本协议的接受，即表示您同意接受本协议各项条款的约束。您务必保证从指尖阅读指定的站点下载红桃免费小说产品以及指尖阅读发行的介质上获得红桃免费小说产品，否则因此导致可能的风险及损失，指尖阅读不承担任何责任。
  .article
    p 二、权利声明
    p 1、指尖阅读系红桃免费小说的著作权人，红桃免费小说的一切知识产权，以及与红桃免费小说相关的所有信息内容，包括但不限于文字表述及其组合、图标、图饰、图像、图表、色彩、界面设计、版面框架、有关数据、附加程序、印刷材料或电子文档等均为指尖阅读所有，受著作权法和国际著作权条约以及其他知识产权法律法规的保护。
    p 2、未经指尖阅读书面同意，用户不得以任何营利性或非营利性的目的自行实施、利用、转让或许可任何第三方实施、利用、转让上述知识产权，指尖阅读保留追究上述未经许可行为的权利。
    p 3、禁止反向工程、反向编译和反向汇编：用户不得对本软件产品进行反向工程（Reverse Engineer）、反向编译（Decompile）或反向汇编（Disassemble），同时不得改动编译在程序文件内部的任何资源。除法律、法规明文规定允许上述活动外，用户必须遵守此协议限制。
    p 4、组件分割：本软件产品是作为一个整体产品而被授予许可使用,用户不得将各个部分分开用于任何目的。
    p 5、个别授权：如需进行商业性的销售、复制、分发，包括但不限于软件销售、预装、捆绑等，必须获得指尖阅读的书面授权和许可。
    p 6、保留权利：本协议未明示授权的其他一切权利仍归指尖阅读所有，用户使用其他权利时必须获得指尖阅读的书面同意。
    p 7、红桃免费小说提供的书籍内容仅代表作者自己的立场和观点，与指尖阅读无关，由作者本人承担一切法律责任。
  .article
    p 三、用户使用须知
    p 1、软件功能：查找、浏览电子书；充值、购买电子书；阅读、保存阅读进度；回复、评论电子书；签到领金币并提取指定金额。
    p 2、关于数字内容的付费：本软件内数字内容由免费内容和收费内容组成，免费内容分为限时免费内容和永久免费内容。指尖阅读有权决定所提供服务的标准和收费方式，并在相关服务页面对资费标准作出提示，用户有权选择是否支付相应费用以继续使用本软件提供的收费服务。用户在本软件注册账户并充值后获得对应的虚拟币，用户可使用虚拟币购买本软件提供的付费服务。用户一旦充值成功，不得以任何理由要求指尖阅读退还全部或部分已充值款项，因不可抗力或指尖阅读单方面原因导致本协议终止的情况除外。
    p 3、关于付费退换：一个月按照30天计算，1天会员充值一旦成功，不适用无理由退换，请仔细考虑后购买。
    p 4、软件的修改和升级：指尖阅读保留随时为用户提供本软件的修改、升级版本的权利。由用户选择确定后，软件会进行升级更新，使用运营商网络产生相应的数据流量费，由运营商收取。
    p 5、用户应在遵守法律及本协议的前提下使用本软件。用户无权实施包括但不限于下列行为:
    p （1）删除或者改变本软件上的所有权利管理电子信息；
    p （2）故意避开或者破坏著作权人为保护本软件著作权而采取的技术措施；
    p （3）利用本软件误导、欺骗他人;
    p （4）违反国家规定，对计算机信息系统功能进行删除、修改、增加、干扰，造成计算机信息系统不能正常运行；
    p （5）未经允许，进入计算机信息网络或者使用计算机信息网络资源；
    p （6）未经允许，对计算机信息网络功能进行删除、修改或者增加；
    p （7）未经允许，对计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加；
    p （8）破坏本软件系统或网站的正常运行，故意传播计算机病毒等破坏性程序；
    p （9）其他任何危害计算机信息网络安全的行为。
    p 6、用户的账号安全相关说明：
    p （1）为保护账户安全，避免账号密码共享泄漏被盗，红桃免费小说帐号仅限个人使用，不允许转借或租赁他人；
    p （2）为了你的账号安全，禁止使用模拟器登录红桃免费小说账号，一经系统核实将永久封禁该账号；
    p 7、对于从非指尖阅读指定站点下载的本软件产品以及从非指尖阅读发行的介质上获得的本软件产品，指尖阅读无法保证该软件是否感染计算机病毒、是否隐藏有伪装的木马程序或者黑客软件，使用此类软件，将可能导致不可预测的风险，建议用户不要轻易下载、安装、使用，指尖阅读不承担任何由此产生的法律责任。
    p 8、隐私权保护
    p 指尖阅读承诺遵守《隐私政策》以及适用法律的规定。指尖阅读制定了以下四项隐私权保护原则，指导我们如何来处理产品中涉及到用户隐私权和用户信息等方面的问题：
    p （1）利用我们收集的信息为用户提供有价值的产品和服务。
    p （2）开发符合隐私权标准和隐私权惯例的产品。
    p （3）将个人信息的收集透明化。
    p （4）尽最大的努力保护我们掌握的信息。
  .article
    p 四、对用户和第三方的知识产权的保护
    p 1、用户在使用本软件所含服务过程中，可能需要通过发表评论等各种方式向指尖阅读提供内容，用户在本软件上发表的全部原创内容，著作权均归用户本人所有。用户发表的评论仅代表用户观点，与指尖阅读无关。
    p 2、用户不能侵犯包括他人的著作权在内的知识产权以及其他权利。一旦由于用户发表的任何内容发生法律纠纷，其责任由用户本人承担。
    p 3、对于用户发表到本软件上的任何内容，用户同意授权指尖阅读在全球范围内具有免费的、永久性的、不可撤销的、非独家的权利和许可，允许指尖阅读以使用、复制、修改、改编、出版、翻译、再许可、创作衍生作品、出版、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。并且，用户许可指尖阅读有权利就任何主体侵权而单独采取法律行动（包括但不限于诉讼、举报、律师函等形式）。
    p 4、如用户的言论侵犯了第三方的著作权或其他权利，第三方提出异议的时候，指尖阅读有权删除相关的内容，且追究用户的法律责任。
    p 5、未经指尖阅读书面许可，禁止使用任何爬虫程序、蜘蛛程序、拟人程序、其他自动设备，或手动程序来读取、复制、存储本软件或其所包含的任何内容。否则，指尖阅读有权依法追究法律责任。
  .article
    p 五、内容版权声明
    p 指尖阅读承诺遵守并尊重中国现行法律法规及其他规范性文件对著作权人的保护，并依照规定制定了 权利人保护指引。作为权利人，当您发现红桃免费小说提供的内容侵犯了您的合法权益时，您应当按照处理流程首先向我们发送“权利通知”，我们将根据中国法律法规和政府规范性文件采取措施移除相关内容或断开、屏蔽相关链接。
  .article
    p 六、免责及责任的限制
    p 1、用户确认，其知悉本软件所有功能及指尖阅读为实现本软件各功能所进行的必要操作，其根据自身需求自愿选择使用本软件及相关服务，因使用本软件及相关服务所存在的风险和一切后果将完全由其自己承担，指尖阅读不承担任何责任。
    p 2、本软件经过详细的测试，但不能保证与所有的软硬件系统完全兼容，不能保证本软件完全没有错误。如果出现不兼容及软件错误的情况，用户可拨打技术支持电话将情况报告指尖阅读，获得技术支持。如果无法解决兼容性问题，用户可以删除本软件。
    p 3、在适用法律允许的最大范围内，对因使用或不能使用本软件所产生的损害及风险，包括但不限于直接或间接的个人损害、商业赢利的丧失、贸易中断、商业信息的丢失或任何其它经济损失，指尖阅读不承担任何责任。
    p 4、对于因电信系统或互联网网络故障、手机故障或病毒、信息损坏或丢失、手机系统问题或其它任何不可抗力原因而产生损失，指尖阅读不承担任何责任。
    p 5、用户违反本协议规定，对指尖阅读造成损害的，指尖阅读有权采取包括但不限于中断使用许可、停止提供服务、限制使用、法律追究等措施。
  .article
    p 七、法律及争议解决
    p 1、本协议适用中华人民共和国法律。
    p 2、因本协议引起的或与本协议有关的任何争议，各方应友好协商解决；协商不成的，任何一方均有权向指尖阅读住所地法院提起诉讼。
  .article
    p 八、其他条款
    p 1、如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款被视为删除，但本协议的其余条款仍应有效并且有约束力。
    p 2、指尖阅读有权随时根据有关法律、法规的变化以及公司经营状况和经营策略的调整等修改本协议。修改后的协议会在指尖阅读网站上公布，并随附于新版本软件。当发生有关争议时，以最新的协议文本为准。如果不同意改动的内容，用户可以自行删除本软件。如果用户继续使用本软件，则视为您接受本协议的变动。
    p 3、指尖阅读在法律允许的最大范围内对本协议拥有解释权与修改权。
    p 4、感谢您使用本软件，任何时候如果您对我们的声明内容有疑问，请联系我们的电子邮箱：kefu@bayread.com。
</template>

<script>
export default {
  data() {
    return {}
  },
  methods: {},
  mounted() {},
}
</script>

<style lang="stylus" rel="stylesheet/stylus">
@import '../../styles/index.styl';
.agreement
  padding 10px 20px
  .title
    font-size 20px
    padding 15px 0
    line-height 28px
    color #3b8dd1
    font-weight 600
    border-bottom 1px solid #f0f0f0
    margin-bottom 15px
  .article
    font-size 14px
    white-space pre-wrap
    line-height 1.6
    margin-bottom 20px
    p
      line-height 1.6
</style>
