<template lang="pug">
.agreement
  .title 隐私政策
  .article
    p 更新日期：2021年06月02日
    p 生效日期：2021年06月02日
    p 提示
    p 本隐私政策适用于北京蓝湾博阅科技有限公司（以下简称我公司）提供的必看小说的产品及服务。本隐私政策中必看小说的客户端软件可能会涉及不同应用版本，用户需选择与所安装手机相匹配的软件版本，不同版本的必看小说所提供的功能和服务可能有所不同。
    p 我公司深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我公司致力于维持您对我公司的信任，恪守以下原则保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我公司承诺，我公司将按业界成熟的安全标准采取相应的安全保护措施来保护您的个人信息。
    p 为了更好的保护您的个人信息，建议您仔细阅读更新后的隐私政策。如您对本隐私政策条款有任何异议或疑问，您可通过本隐私政策第九条公布的联系方式与我公司联系。
  .article
    p 目录
    p 一、我公司如何收集和使用您的个人信息
    p 二、我公司如何使用Cookie和同类技术
    p 三、我公司如何共享、转让、公开披露您的个人信息
    p 四、我公司如何保护您的个人信息
    p 五、您的权利
    p 六、我公司如何处理儿童的个人信息
    p 七、您的个人信息如何在全球范围转移
    p 八、本隐私政策如何更新
    p 九、如何联系我公司
    p 十、争议解决
    p 一、我公司如何收集和使用您的个人信息
    p 1、我公司如何收集和使用您的个人信息
  .table
    .t_line
      .th.td 收集个人信息场景
      .th.td 收集个人信息的范围
      .th.td 收集个人信息的目的
      .th.td 拒绝后果
    .t_line
      .td 使用手机号登录
      .td 手机号、创建的用户名和密码、您的生日、性别
      .td 创建账号
      .td 如果不创建账号，并不会影响您使用必看小说阅读书籍、搜索浏览、会员书币充值功能，但会影响您查看您的金币流水、申请提现、同步您过往书籍阅读记录、发表评论等附加业务功能
    .t_line
      .td 使用第三方帐号微信登录
      .td 微信头像、昵称、地区、性别
      .td 创建账号
      .td 如您拒绝授权前述信息，您将无法使用第三方平台账号登录必看小说及同步您的过往书籍阅读记录，但并不会影响您使用必看小说搜索浏览等功能。
    .t_line
      .td 使用第三方账号QQ登录
      .td QQ头像、昵称、地区、性别
      .td 创建账号
      .td 如您拒绝授权前述信息，您将无法使用第三方平台账号登录必看小说及同步您的过往书籍阅读记录，但并不会影响您使用必看小说搜索浏览等功能。
    .t_line
      .td 使用第三方新浪微博登录
      .td 头像、昵称
      .td 创建账号
      .td 如您拒绝授权前述信息，您将无法使用第三方平台账号登录必看小说及同步您的过往书籍阅读记录，但并不会影响您使用必看小说搜索浏览等功能。
    .t_line
      .td 使用第三方华为账号登录
      .td 头像、昵称
      .td 创建账号
      .td 如您拒绝授权前述信息，您将无法使用第三方平台账号登录必看小说及同步您的过往书籍阅读记录，但并不会影响您使用必看小说搜索浏览等功能。
    .t_line
      .td 使用第三方苹果ID登录
      .td 苹果ID
      .td 创建账号
      .td 如您拒绝授权前述信息，您将无法使用第三方平台账号登录必看小说及同步您的过往书籍阅读记录，但并不会影响您使用必看小说搜索浏览等功能。
    .t_line
      .td 个性化推荐
      .td 操作日志，包括阅读兴趣偏好、搜索关键字词记录、阅读记录、阅读时长、读过的书籍和章节、书架信息、地理位置信息、手机软件安装列表
      .td 个性化书籍以及个性化广告的推荐、为您推荐更适合的定制化服务
      .td 无法获得个性化推荐服务，但不影响使用必看小说的其他功能。您可以通过系统设置关闭个性化推荐的授权，在个性化推荐在我的页面-我的设置-隐私设置里将个性化推荐功能关闭。
    .t_line
      .td 安全管理功能
      .td 设备型号、IP地址、设备软件版本信息、操作系统版本号/类型、唯一设备识别码（ IMEI/Android ID/IDFA/OpenUDID/GUID/SIM卡 IMSI 信息等）、设备MAC地址、网络接入方式及类型、操作日志)
      .td 为向您提供安全稳定的服务、保障您的账户财产安全、预防冒名登录
      .td 如果您不同意我们记录前述信息，将无法完成风控验证，而无法使用必看小说
    .t_line
      .td 支付
      .td 您在第三方支付渠道的user ID（支付宝user ID、微信ID、苹果ID、设备标识信息）
      .td 会员充值、购买服务
      .td 无法使用该项功能
    .t_line
      .td 产品适配
      .td 唯一设备标识别码、操作系统名称和版本
      .td 必看小说产品可以适配您的设备
      .td 设备与必看小说可能不适配
    .t_line
      .td 实物奖品发放及核实中奖用户信息
      .td 您提供的姓名、收货地址和联系电话、身份证号
      .td 寄送奖品、代扣代缴个人所得税
      .td 无法获得奖品
  .article
    p 2、您理解并同意，以下情形中，我公司收集、使用您的个人信息不必另行征得您的授权同意：
    p 1) 我公司履行法律法规规定的义务相关的；
    p 2) 与国家安全、国防安全直接相关的；
    p 3) 与公共安全、公共卫生、重大公共利益直接相关的；
    p 4) 与刑事侦查、起诉、审判和判决执行等直接相关的；
    p 5) 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您授权同意的；
    p 6) 所涉及的您的信息是您自行向社会公众公开的；
    p 7) 根据您要求签订和履行合同所必需的；
    p 8) 从合法公开披露的信息中收集您的个人信息的，如合法的新闻报道、政府信息公开等渠道；
    p 9) 维护所提供我公司必看小说产品或服务的安全稳定运行所必需的，如发现、处置产品或服务的故障；
    p 10）法律法规等规定的其他情形。
  .article
    p 二、我公司如何使用Cookie和同类技术
    p 为了收集前述个人信息，我公司和第三方授权合作伙伴均可能使用技术，通过理解和记忆您的特定使用偏好使用以下技术，为您提供更加个性化的体验：
    p 1、Cookie：为确保必看小说正常运转，我公司会在您的移动设备上存储名为Cookie的小数据文件。Cookie通常包含标识符、站点名称以及一些号码和字符。借助于Cookie，网站能够存储您的偏好等数据。我公司不会将Cookie用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookie。
    p 2)SDK：SDK是我公司嵌入必看小说的一组工具和/或代码，允许第三方授权合作伙伴收集有关用户如何与服务交互的信息；
  .article
    p 三、我公司如何共享、转让、公开披露您的个人信息
    p 1、共享
    p 我公司不会与我公司以外的任何公司、组织和个人分享您的个人信息，但以下情况除外：
    p （1）事先已获得您的明确授权或同意；
    p （2）根据适用的法律法规、法律程序、政府的强制命令或司法裁定而需共享您的个人信息；
    p （3）在法律要求或允许的范围内，为了保护必看小说及其用户或社会公众的利益、财产或安全免遭损害而有必要提供您的个人信息给第三方；
    p （4）您的个人信息可能会在我公司关联公司之间共享。我们只会共享必要的个人信息，且这种共享亦受本隐私政策声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意；
    p （5）为实现本隐私政策中声明的目的，我公司的某些服务将由授权合作伙伴提供。我公司可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如，在发放实体奖品时，我公司必须与物流服务提供商共享您的个人信息才能安排送货，或者安排合作伙伴提供服务。我公司仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我公司的合作伙伴无权将共享的个人信息用于任何其他用途。如果您拒绝我公司的合作伙伴在提供服务时收集为提供服务所必需的个人信息，将可能导致您无法在必看小说中使用该第三方服务。我公司的授权合作伙伴包括以下几大类型：
    p ①第三方物流服务提供商；
    p ②第三方SDK类服务商：为向您推荐更适合您的服务，我公司的产品和服务可能包括第三方的产品和服务，以及第三方网站的链接。当您使用这些产品或服务时，也可能收集您的信息。目前我们接入的第三方SDK如下：
  .table
    .t_line
      .th.td 序号
      .th.td SDK名称
      .th.td 场景描述
      .th.td 个人信息字段
      .th.td 隐私政策链接
      .th.td 第三方SDK名称
    .t_line
      .td 1
      .td 微信
      .td 登录、将页面分享至微信好友或朋友圈、使用微信支付
      .td 访问网络权限、访问网络状态权限、读取设备唯一标识码（IMEI、MAC地址)
      .td https://weixin.qq.com/cgi-bin/readtemplate?lang=zh_CN&t=weixin_agreement&s=privacy
      .td 深圳市腾讯计算机系统有限公司
    .t_line
      .td 2
      .td 支付宝
      .td 支付宝支付
      .td 设备唯一标识码（设备MAC地址、IMEI）、读取手机状态、写入外部存储，访问网络，访问网络信息，访问WI—FI网络信息
      .td https://render.alipay.com/p/c/k2cx0tg8
      .td 支付宝（中国）网络技术有限公司
    .t_line
      .td 3
      .td 友盟SDK
      .td 统计分析
      .td 设备唯一标识码（IMEI/android ID/IDFA/OPENUDID/GUID、SIM卡IMSI信息）、设备MAC地址、您的用户名、每次使用产品的时长、用于反作弊的地理位置信息、软件安装列表
      .td https://www.umeng.com/policy
      .td 友盟同欣（北京）科技有限公司
    .t_line
      .td 4
      .td 小米PUSH
      .td 推送消息
      .td 设备标识信息（IMEI、MAC地址）
      .td https://dev.mi.com/console/doc/detail?pId=1339
      .td 小米科技
    .t_line
      .td 5
      .td VIVO PUSH
      .td 推送消息
      .td 设备标识信息（IMEI、MAC地址）
      .td https://dev.vivo.com.cn/documentCenter/doc/366
      .td 广东天宸科技有限公司
    .t_line
      .td 6
      .td OPPO PUSH
      .td 推送消息
      .td 设备标识信息（IMEI、MAC地址）
      .td https://open.oppomobile.com/wiki/doc#id=10288
      .td 广东欢太科技有限公司
    .t_line
      .td 7
      .td 魅族PUSH
      .td 推送消息
      .td 设备标识信息（IMEI、MAC地址）
      .td https://open.flyme.cn/open-web/views/push.html
      .td 魅族科技
    .t_line
      .td 8
      .td 华为PUSH
      .td 推送消息
      .td 设备标识信息（IMEI、MAC地址）
      .td https://developer.huawei.com/consumer/cn/doc/development/HMSCore-Guides-V5/privacy-statement-0000001050042021-V5
      .td 华为技术有限公司
    .t_line
      .td 9
      .td 数盟
      .td 设备真实性验证和识别
      .td 设备制造商、设备型号、设备系统版本、应用版本、设备标识信息（如IMEI、MAC地址、IDFA、Android ID、ICCID）、设备网络状况信息及其他设备物理环境信息、软件安装列表、蓝牙地址
      .td https://www.shuzilm.cn/main/privacy.html
      .td 北京数字联盟网络科技有限公司
    .t_line
      .td 10
      .td 腾讯QQSDK
      .td 用户账号登录
      .td 设备唯一识别码（IMEI、MAC地址）、软件安装列表
      .td https://ti.qq.com/agreement/qqface.html?appname=mqq_2019
      .td 深圳市腾讯计算机系统有限公司
    .t_line
      .td 11
      .td 微博SDK
      .td 用户账号登录
      .td 设备唯一识别码（IMEI、MAC地址）、软件安装列表
      .td https://open.weibo.com/wiki/%E5%BC%80%E5%8F%91%E8%80%85%E5%8D%8F%E8%AE%AE#.E9.9A.90.E7.A7.81.E7.9B.B8.E5.85.B3.E6.9D.A1.E6.AC.BE
      .td 微梦公司
  .article
    P 为了最大程度保障您的信息安全，我公司建议您在使用第三方SDK服务前先行查看其隐私条款。如果您最不希望其个人信息处理和使用，您可以登录网址第三方SDK网站进行退出操作。
    P 对我公司与之共享个人信息的公司、组织和个人，我公司会与其签署严格的保密协定，要求他们按照我公司的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。
    P 2、转让
    P 我公司不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
    P （1）获得您的明确同意后，我公司会向其他方转让您的个人信息；
    P （2）在涉及合并、收购或破产清算时，如涉及到个人信息转让，我公司会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我公司将要求该公司、组织重新向您征求授权同意。
    P 3、公开披露
    P 我公司仅会在以下情况下，公开披露您的个人信息：
    P （1）获得您明确同意后；
    P （2）基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我公司可能会公开披露您的个人信息。
  .article
    P 四、我公司如何保护您的个人信息
    P 1、我公司已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我公司会采取一切合理可行的措施，保护您的个人信息。例如我公司使用加密技术确保数据的保密性；我公司会使用受信赖的保护机制防止数据遭到恶意攻击；我公司会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我公司会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
    P 2、我公司在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内，不会进行任何数据出境。您的个人信息存储期限为10年；10年期满后如您继续在使用必看小说服务的，该等服务必需的个人信息的存储期限再续10年，如届时您已经不再使用必看小说服务的，我公司将及时删除您的个人信息。
    P 3、互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我公司强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我公司保证您的帐号安全。
    P 4、互联网环境并非百分之百安全，我公司将尽力确保或担保您发送给我公司的任何信息的安全性。如果我公司的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我公司将承担相应的法律责任。
    P 5、在不幸发生个人信息安全事件后，我公司将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我公司已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我公司将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我公司会采取合理、有效的方式发布公告。
    P 同时，我公司还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
  .article
    P 五、您的权利
    P 按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我公司保障您对自己的个人信息行使以下权利：
    P 1、访问您的个人信息
    P 您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：
    P （1）访问头像、昵称、性别、生日等基本信息：
    P ①进入必看小说后，点击“我的”
    P ②点击头像栏
    P ③进行信息查询和访问
    P 2、更正您的个人信息
    P 当您发现我公司处理的关于您的个人信息有错误时，您有权要求我公司做出更正。您可以通过“1访问您的个人信息”中罗列的方式提出更正申请。
    P 3、删除您的个人信息
    P 在以下情形中，您可以向我公司提出删除个人信息的请求：
    P （1）如果我公司处理个人信息的行为违反法律法规；
    P （2）如果我公司收集、使用您的个人信息，却未征得您的同意；
    P （3）如果我公司处理个人信息的行为违反了与您的约定；
    P （4）如果您不再使用我公司的产品或服务，或您注销了帐号；
    P （5）如果我公司不再为您提供产品或服务。
    P 若我公司决定响应您的删除请求，我公司还将同时通知从我公司获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
    P 当您从我公司的服务中删除信息后，我公司可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
    P 4、撤回同意
    P 您可以通过关闭设备功能改变您授权我公司继续收集个人信息的范围或撤回您的授权。您还可以通过注销帐户的方式，撤回我公司继续收集您个人信息的全部授权。
    P 5、退出帐户
    P 您随时可退出此前注册的帐户，您可以通过以下方式自行操作：
    P （1）进入必看小说后，点击“我的”
    P （2）点击“我的设置”
    P （3）点击“退出登录”
    P 在退出帐户之后，我公司将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。
    P 在以下情形中，按照法律法规要求，我公司将无法响应您的请求：
    P （1）与国家安全、国防安全直接相关的；
    P （2）与公共安全、公共卫生、重大公共利益直接相关的；
    P （3）与犯罪侦查、起诉、审判和判决执行等直接相关的；
    P （4）有充分证据表明您存在主观恶意或滥用权利的；
    P （5）响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
    P （6）涉及商业秘密的。
    P 6、注销账号
    P 您随时可以注销此前注册的账号，在账户注销后，原账户相关信息会被清空且无法找回且无法进行以下操作：
    P （1）账号中的个人信息、历史信息、书架记录等将被清空；
    P （2）账号中的权益将被取消，已购买会员产品将视为自动放弃；
    P （3）账号中的邀请好友关系将被清空；
    P （4）账号中的签到记录将被清空；
    P （5）账号中的金币余额、现金余额、书币、书券将被清空；
    P 在以下情形中，按照法律法规要求，我公司可能无法响应您的请求：
    P （1）与国家安全、国防安全直接相关的；
    P （2）与公共安全、公共卫生、重大公共利益直接相关的；
    P （3）与犯罪侦查、起诉、审判和判决执行等执行相关的；
    P （4）有充分证据表明您存在主观恶意或滥用权力的；
    P （5）响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
    P （6）涉及商业秘密的。
    P 注销操作
    P 点击“我的”，点击“我的设置”，点击“账号注销”，点击“阅读并同意注销协议”，点击“确认注销”。
  .article
    P 六、我公司如何处理儿童的个人信息
    P 我公司的产品、网站和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户帐户。
    P 对于经父母同意而收集儿童个人信息的情况，我公司只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。
    P 尽管当地法律和习俗对儿童的定义不同，但我公司将不满18周岁的任何人均视为儿童。
    P 如果我公司发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
  .article
    p 七、您的个人信息如何在全球范围转移
    p 目前我公司不会跨境传输或存储您的个人信息。将来如需跨境传输或存储的，我公司会向您告知信息出境的目的、接收方、安全保障措施和安全风险，并征得您的同意。
  .article
    p 八、本隐私政策如何更新
    p 我公司的隐私政策可能变更。未经您明确同意，我公司不会削减您按照本隐私政策所应享有的权利。我公司会在本页面上发布对本隐私政策所做的任何变更。对于重大变更，我公司还会提供更为显著的通知。本隐私政策所指的重大变更包括但不限于：
    p 1、我公司的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
    p 2、我公司在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
    p 3、个人信息共享、转让或公开披露的主要对象发生变化；
    p 4、您参与个人信息处理方面的权利及其行使方式发生重大变化；
    p 5、我公司负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
    p 6、个人信息安全影响评估报告表明存在高风险时。
    p 我公司还会将本隐私政策的旧版本存档，供您查阅。
  .article
    p 九、如何联系我公司
    p 如您对本隐私政策有任何疑问、意见或建议，您可以通过如下方式与我公司联系。一般情况下，我公司将在15个工作日内回复您。
    p 电子邮件：kefu@bayread.com
    p 电 话：15810941216
  .article
    p 十、争议解决
    p 因本隐私政策产生的及与本隐私政策相关的任何争议，应提交我公司所在地有管辖权的法院诉讼解决
</template>

<script>
export default {
  data() {
    return {}
  },
  methods: {},
  mounted() {},
}
</script>

<style lang="stylus" rel="stylesheet/stylus">
@import '../../styles/index.styl';
.agreement
  padding 10px 20px
  .title
    font-size 20px
    padding 15px 0
    line-height 28px
    color #3b8dd1
    font-weight 600
    border-bottom 1px solid #f0f0f0
    margin-bottom 15px
  .article
    font-size 14px
    white-space pre-wrap
    line-height 1.6
    margin-bottom 20px
    p
      line-height 1.6
  .table
    font-size 14px
    .t_line
      display flex
      &:first-of-type
        .td
          border-top-width 1px
      .td
        width 80px
        white-space pre-wrap
        word-break break-all
        border 1px solid #333333
        border-left-width 0
        padding 0 2px
        border-top-width 0
        &:first-of-type
          border-left-width 1px
      .th
        text-align left
</style>
