<template lang="pug">
.agreement
  .title 隐私政策
  .article
    p 生效日期：2021年7月12日
    p 提示：
    p 北京蓝湾科技有限公司（以下称为“我们”）高度重视个人信息的保护，在您使用我们提供的【蓝湾SDK】服务时（以下可称为“【蓝湾SDK】服务”），我们将按照本隐私政策收集、使用您和您的最终用户（即“您的产品的最终用户”或“您的产品的终端用户”，以下同）的个人信息。我们希望通过本隐私政策向您清晰地介绍我们对您和您的最终用户的个人信息的处理方式，因此我们建议您完整地阅读本隐私政策，以帮助您了解维护自己隐私权的方式。
    p 在使用【蓝湾SDK】服务前，请您务必仔细阅读并透彻理解本政策，在确认充分理解并同意后使用相关产品或服务。
  .article
    p 目录
    p 一、我们如何收集和使用您的个人信息
    p 二、我们如何使用Cookie和同类技术
    p 三、我们如何共享、转让、公开披露您的个人信息
    p 四、我们如何保护您的个人信息
    p 五、我们如何处理儿童的个人信息
    p 六、您的个人信息如何在全球范围转移
    p 七、本隐私政策如何更新
    p 八、如何联系我们
    p 九、争议解决
  .article
    p 一、我们如何收集和使用您以及您最终用户的个人信息
    p 我们收集信息是为了更好、更优、更准确的完成您所选择的服务。我们收集信息的方式如下：
    p 1、设备信息
    p  为了让最终用户有更好的体验，提升信息触达最终用户的效率以及准确率，改进及优化产品和服务在开发者侧以及最终用户侧的双重体验，我们会收集最终用户的设备属性信息（例如最终用户的硬件型号、操作系统版本、国际移动设备身份码IMEI、Android Id）、我们会对收集的信息进行加密，从而提高对隐私的保护。
    p 2、读取/写入外部存储卡
    p 获取理由： 帮助开发者进行最终用户设备识别，保障开发者及最终用户正常使用推广或信息服务，提升服务的效率以及准确率；更准确定位并解决产品和服务使用问题，改进及优化产品和服务体验。
    p 3、获取网络状态
    p  获取理由：保持移动应用网络连接的稳定性，提供稳定连续的推广或消息服务
  .article
    p 二、我们如何使用Cookie和同类技术
    p 为了收集前述个人信息，我们和第三方授权合作伙伴均可能使用技术，通过理解和记忆您的特定使用偏好使用以下技术，为您提供更加个性化的体验：
    p 1、Cookie：为确保必看小说正常运转，我们会在您的移动设备上存储名为Cookie的小数据文件。Cookie通常包含标识符、站点名称以及一些号码和字符。借助于Cookie，网站能够存储您的偏好等数据。我们不会将Cookie用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookie。
    p 2)SDK：SDK是我们嵌入必看小说的一组工具和/或代码，允许第三方授权合作伙伴收集有关用户如何与服务交互的信息；
  .article
    p 三、我们如何共享、转让、公开披露您以及您最终用户的个人信息
    p 1、共享
    p 我们不会与我们以外的任何公司、组织和个人分享您的个人信息，但以下情况除外：
    p （1）事先已获得您的明确授权或同意；
    p （2）根据适用的法律法规、法律程序、政府的强制命令或司法裁定而需共享您的个人信息；
    p （3）在法律要求或允许的范围内，为了保护必看小说及其用户或社会公众的利益、财产或安全免遭损害而有必要提供您的个人信息给第三方；
    p （4）您的个人信息可能会在我们关联公司之间共享。我们只会共享必要的个人信息，且这种共享亦受本隐私政策声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意；
    p （5）为实现本隐私政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。如果您拒绝我们的合作伙伴在提供服务时收集为提供服务所必需的个人信息，将可能导致您无法在必看小说中使用该第三方服务
    p 2、转让
    p 我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
    p （1）获得您的明确同意后，我们会向其他方转让您的个人信息；
    p （2）在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
    p 3、公开披露
    p 我们仅会在以下情况下，公开披露您的个人信息：
    p （1）获得您明确同意后；
    p （2）基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
  .article
    p 四、我们如何保护您的个人信息
    p 1、我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如我们使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
    p 2、我们在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内，不会进行任何数据出境。您的个人信息存储期限为10年；10年期满后如您继续在使用必看小说服务的，该等服务必需的个人信息的存储期限再续10年，如届时您已经不再使用必看小说服务的，我们将及时删除您的个人信息。
    p 3、互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的帐号安全。
    p 4、互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
    p 5、在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
    p 同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
  .article
    p 五、我们如何处理儿童的个人信息
    p 我们的产品、网站和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户帐户。
    p 对于经父母同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信息。
    p 尽管当地法律和习俗对儿童的定义不同，但我们将不满18周岁的任何人均视为儿童。
    p 如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
  .article
    p 六、您的个人信息如何在全球范围转移
    p 目前我们不会跨境传输或存储您的个人信息。将来如需跨境传输或存储的，我们会向您告知信息出境的目的、接收方、安全保障措施和安全风险，并征得您的同意。
  .article
    p 七、本隐私政策如何更新
    p 我们的隐私政策可能变更。未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本隐私政策所做的任何变更。对于重大变更，我们还会提供更为显著的通知。本隐私政策所指的重大变更包括但不限于：
    p 1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
    p 2、我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
    p 3、个人信息共享、转让或公开披露的主要对象发生变化；
    p 4、您参与个人信息处理方面的权利及其行使方式发生重大变化；
    p 5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
    p 6、个人信息安全影响评估报告表明存在高风险时。
    p 我们还会将本隐私政策的旧版本存档，供您查阅。
  .article
    p 八、如何联系我们
    p 如您对本隐私政策有任何疑问、意见或建议，您可以通过如下方式与我们联系。一般情况下，我们将在15个工作日内回复您。
    p 电子邮件：kefu@bayread.com
    p 电 话：15810941216
  .article
    p 九、争议解决
    p 因本隐私政策产生的及与本隐私政策相关的任何争议，应提交我们所在地有管辖权的法院诉讼解决。
</template>

<script>
export default {
  data() {
    return {}
  },
  methods: {},
  mounted() {},
}
</script>

<style lang="stylus" rel="stylesheet/stylus">
@import '../../styles/index.styl';
.agreement
  padding 10px 20px
  .title
    font-size 20px
    padding 15px 0
    line-height 28px
    color #3b8dd1
    font-weight 600
    border-bottom 1px solid #f0f0f0
    margin-bottom 15px
  .article
    font-size 14px
    white-space pre-wrap
    line-height 1.6
    margin-bottom 20px
    p
      line-height 1.6
  .table
    font-size 14px
    .t_line
      display flex
      &:first-of-type
        .td
          border-top-width 1px
      .td
        width 80px
        white-space pre-wrap
        word-break break-all
        border 1px solid #333333
        border-left-width 0
        padding 0 2px
        border-top-width 0
        &:first-of-type
          border-left-width 1px
      .th
        text-align left
</style>
