<template lang='pug'>
.debris_rule
  .debris_rule_content
    h2.rule_title 规则
    .rule_desc
      p 公司将于2021年2月1日至2月19日暂停发货，春节放假期间产生的订单，将于2月20日起根据订单顺序陆续恢复发货。
    .rule_desc
      h3 一、活动参与要求
      p 1、本活动面向注册{{ appName }}免费小说（以下称本产品）的所有用户。
      p 2、同一注册账号、同一手机号、同一终端设备或同一微信号，符合以上任一条件的，均视为同一用户。
    .rule_desc
      h3 二、活动时间
      p {{ activityDate }}。
    .rule_desc
      h3 三、活动奖品
      p 1、新款5G手机 。比如：集满9个新款5G手机碎片可以兑换一部新款5G手机。用户成功兑换奖品后，此前已获得的该奖品碎片全部清零。
      p 2、iPad mini5
      p 3、金龙鱼调和油l+香米套装
      p 4、纳丽丝洗衣液1袋
      p 5、幸福相约沐浴露1瓶
      p 6、抽纸1提
      p 7、黄河滩枣1包
      p 8、牙膏1支
      p 9、珊瑚绒毛巾1条
      p 10、洗碗巾1条
      p 11、1日会员
      p 12、100金币
      p 13、50金
      p 14、20金币
    .rule_desc
      h3 四、活动规则
      p 1、用户完成本产品碎片中心页面的各种任务可获得碎片，
        | 碎片种类由系统随机发放。在当个活动周期集满9个同样类型的碎片可兑换对应的奖品。
        | 具体为：集满9个iPad mini5碎片可兑换1部iPad mini5；
        | 集满9个新款5G手机碎片可兑换1部新款5G手机；
        | 集满9个金龙鱼调和油+香米套装碎片可兑换1套金龙鱼稻谷鲜生调和油400ml+生态香米500g套装；
        | 集满9个纳丽丝洗衣液碎片可兑换1袋2kg纳丽丝强效杀菌洗衣液；
        | 集满9个幸福相约沐浴露碎片可兑换1瓶800g幸福相约沐浴露单瓶；
        | 集满9个抽纸碎片可兑换1袋良布竹浆本色柔肤抽纸（8包）；
        | 集满9个黄河滩枣碎片可兑换1包250g黄河滩枣；
        | 集满9个益生菌牙膏碎片可兑换1支益生菌牙膏；
        | 集满9个珊瑚绒毛巾碎片可兑换1条珊瑚绒毛巾；
        | 集满9个洗碗巾碎片可兑换1条双色吸水抹布洗碗巾；
        | 集满9个1日会员碎片可直接获得1日会员；
        | 集满9个“100金币”碎片可直接获得100金币；集满9个“50金币”碎片可直接获得50金币；
        | 集满9个“20金币”碎片可直接获得20金币。
      p 2、每60天为一个活动周期，具体为{{ activityCycleDateFirst }}为一个活动周期，
        | {{ activityCycleDateSecond }}为一个活动周期，以此类推。
      p 3、集碎片方式：
        p （1）用户每日进入本产品碎片中心页面签到，签到完成后可获得一定数量的碎片，碎片种类及数量由系统随机发放。
        p （2）用户每日完成阅读任务会获得碎片，碎片种类及数量由系统随机发放，具体阅读时长及可获得的碎片数量以相应页面显示的内容为准。
        p （3）用户在认真阅读过程中，系统可能会随机发放碎片，碎片种类及数量由系统随机发放。
      p 4、兑奖：
        p （1）用户集满9个相同类型的碎片后需在碎片中心页面“我的奖品”中相应位置点击“兑换”， 兑换成功后需在指定页面填写姓名、手机号、地址等收货信息（用户需提供中国大陆地区的电话和收货地址），本产品客服人员将在20个工作日内与中奖用户取得联系并确认收货信息，遇到法定节假日发货时间延后。
        p （2）用户集满9个相同类型的碎片后需在当个活动周期内兑换并填写姓名、手机号、地址等收货信息，
          | 用户未在当个活动周期内兑换并填写收货信息的，视为中奖用户放弃领奖，本产品概不以其他形式补偿。
        p （3）用户获得的非实物奖品包括1日会员及金币，用户无需在“我的奖品”中“兑换”，
          | 本产品将奖品发放至用户账号。
      p 5、用户成功兑换奖品或获得1日会员或获得金币后，用户此前已获得的该奖品碎片全部清零。每个活动周期最后一日的23点59分，用户账户内所有碎片清零。
      P 6、用户不得以任何不正当手段或舞弊方式参与本活动。一经发现，本产品有权采取限制登录、封禁账号、撤销参与活动及中奖资格、限制再次注册使用等措施。
      p 7、为遵守国家关于个人所得税的相关规定，实物奖品中奖用户需提供身份信息以便本产品进行个人所得税代扣代缴，中奖用户需提供具体身份信息以相应兑奖页面显示的信息为准。如中奖用户未提供该等信息，本产品有权拒绝向中奖用户发放实物奖品。
      p  8、如本活动期间，实物奖品停产等本产品不能控制原因致无法发放奖品给中奖用户的，本产品将向中奖用户提供其他同等价值商品。
    .rule_desc
      h3 五、其他
      p 1、参与本活动前，请详细阅读活动规则及相关条款。凡参与本活动，则视为同意活动规则。
      p 2、本产品碎片中心页面签到天数与本产品金币提现所需连续签到天数为两个独立活动，碎片中心显示签到天数不作为金币提现所需连续签到证明。
      p 3、如遇不可抗力、形势变更等致本活动因无法进行时，本产品有权决定取消、终止、修改或暂停本活动。
      p 4、本产品在法律允许的范围内保留对本活动的最终解释权。
      p 5、请实物中奖用户提供正确的联系方式，如不正确导致无法收到奖品，本产品不予负责。
      p 6、除奖品质量问题外，本活动奖品概不换货。
      p 7、如本规则与《用户协议》或《隐私政策》约定不一致的，以本规则为准
</template>

<script>
export default {
  props: {
    platform: {
      type: String,
      default: '6'
    }
  },
  data() {
    return {
      activityDate: '2020年12月29日-2021年2月27日',
      activityCycleDateFirst: '2020年10月29日-2020年12月28日',
      activityCycleDateSecond: '2020年12月29日-2021年2月27日',
      appName: '必阅'
    }
  },
  mounted() {
    this.$nextTick(() => {
      console.log('platform', this.platform)
      if (this.platform === '6') return
      if (this.platform === '7' || this.platform === '51') {
        this.activityDate = '2021年1月12日-2021年3月12日'
        this.activityCycleDateFirst = '2021年1月12日-2021年3月12日'
        this.activityCycleDateSecond = '2021年3月13日-2021年5月11日'
        this.appName = this.platform === '7' ? '坚果' : '洋葱'
        return
      }
    })
  }
}
</script>

<style lang="stylus" rel="stylesheet/stylus">
.debris_rule
  height auto
  padding 20px 13px 35px 20px
  background url('../../../assets/debris_center/rule_bg.png') no-repeat center center
  background-size 100% 100%
  .debris_rule_content
    padding 0 10px
    box-sizing border-box
  h2.rule_title
    width 28px
    height 20px
    font-size 14px
    font-family PingFangSC-Medium, PingFang SC
    font-weight bold
    color #333333
    line-height 20px
    padding-bottom 10px
  .rule_desc
    h3,p
      font-size 12px
      color #999999
      line-height 18px
      letter-spacing -0.1px
</style>