<template lang="pug">
.agreement
  .title 用户协议
  .article
    p 生效日期：2021年4月28日
    p 请您仔细阅读以下条款，并确认您已完全理解本协议之规定，尤其是免除及限制责任的条款、法律适用及争议解决条款。
    p 若您对本协议任何条款有异议，请停止使用名称为“WiFi钥匙神器”的应用程序所提供的全部服务。
  .article
    p 一、序言
    p 1、勾选本协议前选项框并点击“同意并进入”，将视为您签署了本协议，表明您自愿接受本协议全部条款的约束。本协议构成您与北京指尖阅读科技有限公司（以下称本公司）就WiFi钥匙神器【以下称本软件】之间具有约束力的法律文件。如果您不同意本协议的任何内容，请点击“不同意”，视为您选择放弃使用本软件的服务。
    p 2、未成年人使用本软件
    p （1）若您未满18周岁，则为未成年人，请在监护人监护、指导下阅读本协议和使用本软件。
    p （2） 未成年人用户涉世未深，容易被网络虚象迷惑，且好奇心强，遇事缺乏随机应变的处理能力，很容易被别有用心的人利用而又缺乏自我保护能力。因此，未成年人用户在使用本服务时应注意以下事项，提高安全意识，加强自我保护：
    p （3）认清网络世界与现实世界的区别，避免沉迷于网络，影响日常的学习生活；
    p （4） 填写个人资料时，加强个人保护意识，以免不良分子对个人生活造成骚扰；
    p （5）在监护人或老师的指导下，学习正确使用网络；
    p （6）避免陌生网友随意会面或参与联谊活动，以免不法分子有机可乘，危及自身安全；
    p （7）在使用本软件提供的相关付费服务前，应当取得监护人同意，并使用合法的自有财产获得该等付费服务。
    p  2、本公司有权修改本协议，本公司将以在本软件相关页面公告或发送通知等方式公布修改的内容，修改后的协议一经公布即有效的代替本协议。如果您不同意本协议的修改，请立即停止使用本软件或取消已经获得的服务；如果您选择继续访问或使用本软件，则视为您已接受本协议的修改。
    p 3、本协议所列明的条款，并不能完全涵盖您与本公司之间所有的权利和义务。因此，本公司不定期公布的其他声明、规则等均视为本协议之补充协议，为本协议不可分割的组成部分，与本协议具有同等法律效力。
    p 4、如本协议与本软件补充协议条款不一致，以补充协议条款内容为准。
  .article
    p 二、本软件的服务
    p 1、请您务必从本公司指定的站点下载本软件，否则本公司无法保证该软件的安全性、合法性及正常的使用功能，亦不能对因此给您造成的损失承担赔偿责任。
    p 2、本公司因业务发展需要，可能将视情况对本软件的全部或部分服务进行变更、暂停、限制、终止或撤销。本公司特提醒您注意前述风险，并建议您采取适当的预防性措施。
    p 3、服务内容
    p （1）本软件通过云计算和大数据技术，为您提供免费、稳定、安全的上网服务。
    p （2）WiFi热点安全体系，最大化使用各种连网的移动服务，节约流量，扫除无网断网的状态，确保实现用户免费、安全、便捷连网的需求。
    p 4、广告
    p (1) 您同意本公司可以在提供服务的过程中自行和/或由第三方广告商向您发送广告、推广或宣传信息（包括商业与非商业信息），其方式和范围可不经向您特别通知而变更。
    p (2) 本公司依照法律的规定对第三方广告商履行相关义务，您应当自行判断广告信息的真实性并为自己的判断行为负责，除法律明确规定外，您因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，本公司不承担责任。
    p (3) 您同意，对本软件服务中出现的广告信息，您应审慎判断其真实性和可靠性，除法律明确规定外，您对依该广告信息进行的交易负责。
    p 5、您需对在本软件上所传送信息的真实性、合法性、有效性等负全部责任，因您所传播的信息引发的任何法律责任由您自行承担。本公司同时保留依据法律法规及本协议约定，对因您所传播信息引发的法律责任适时采取相应措施的权利。
    p 6、 您在使用本软件时须遵守法律法规，不得利用本软件从事违法违规行为，以及不得利用本软件制作、上传、复制、发布、传播或者转载如下内容，包括但不限于：
    p (1) 反对宪法所确定的基本原则的；
    p (2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
    p (3) 损害国家荣誉和利益的；
    p (4) 煽动民族仇恨、民族歧视，破坏民族团结的；
    p (5) 破坏国家宗教政策，宣扬邪教和封建迷信的；
    p (6) 散布谣言，扰乱社会秩序，破坏社会稳定的；
    p (7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
    p (8) 侮辱或者诽谤他人，侵害他人合法权益的；
    p (9) 含有法律、行政法规等禁止的其他内容。
    p 如果您违反了以上任一约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求本公司给予协助。造成本公司或第三方损害的，您应依法予以赔偿，本公司不承担任何责任。
    p 如果本公司发现或收到他人举报您发布的内容违反本条约定，本公司有权进行独立判断并采取技术手段予以删除、屏蔽或断开链接。同时，本公司有权视您的行为性质，采取包括但不限于暂停或终止服务，限制、冻结或终止账号使用，追究法律责任等措施。
    p 7、如您的行为侵害任何第三方权利的，您应当独立承担责任；如本公司因此遭受损失的，您应当赔偿由此给本公司造成的一切损失（包括但不限于由此产生的赔偿金、诉讼费、调查取证费、律师费、差旅费）且本公司可以中止对您的服务，解除本协议，且无需退还您所支付的费用（如有）。
  .article
    p 三、隐私政策
    p 1、保护用户个人信息及个人隐私是本公司的基本原则之一。本公司将按照本协议及《WiFi钥匙神器隐私政策》的规定合法收集、使用、安全储存您的个人信息。
    p 2、您在使用本软件的过程中，需要填写一些必要的信息。若国家法律法规有特殊规定的，您可能还需要填写真实的身份信息。若您填写的信息不完整，可能无法使用本软件，或在使用本软件过程中受到限制。
    p 3、本公司将尽一切可能采取适当的技术手段，保证您可以访问、更新和更正自己的注册信息或使用公司的服务时提供的其他个人信息，但出于安全性和身份识别（如找回密码服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。
    p 4、本公司将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。
  .article
    p 四、知识产权
    p 1、本软件在全世界范围内的全部知识产权归本公司独家永久享有，包括但不限于本软件相关的文字表述及其组合、图标、图饰、图像、图表、色彩、界面设计、版面框架、有关数据、附加程序、印刷材料或电子文档等均为本公司所有，受著作权法和国际著作权条约以及其他知识产权法律法规的保护。
    p 2、本软件或者提供服务中所涉及的图形、视频、文字或其组成，以及其他本公司标志及产品、服务名称，均为本公司之知识产权。未经本公司另行事先书面同意，您不得以营利为目的将本公司标识以任何方式展示或使用或作其他处理，也不得向他人表明有权展示、使用或者其他有权处理本公司标识的行为。
    p 3、未经本公司另行书面同意，您不得以任何营利性或非营利性的目的自行实施、利用、转让或许可任何第三方实施、利用、转让上述知识产权，本公司保留追究上述未经许可行为的权利。
    p 4、未经本公司另行书面同意，禁止反向工程、反向编译和反向汇编：您不得对本软件进行反向工程（Reverse Engineer）、反向编译（Decompile）或反向汇编（Disassemble），同时不得改动编译在程序文件内部的任何资源。
    p 5、本软件产品是作为一个整体产品而被授予许可使用,您不得将各个部分分开用于任何目的。
    p 6、如需进行商业性的销售、复制、分发，包括但不限于软件销售、预装、捆绑等，您必须另行取得本公司的书面授权和许可。
    p 7、本协议未明示授权的其他一切权利仍归本公司所有，您使用其他权利时必须另行取得本公司的书面同意。
  .article
    p 五、 不可抗力
    p 1、您理解并同意，在使用本软件服务的过程中，可能会遇到不可抗力等风险因素，使本软件提供的服务发生中断。
    p 不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等，以及社会事件如战争、动乱、政府行为等。出现上述情况时，本公司将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失，本软件在法律允许的范围内免责。
    p 2、在法律允许的范围内，本公司对以下情形导致的服务中断或受阻不承担责任：
    p (1) 受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；
    p (2) 用户或本公司的电脑软件、系统、硬件和通信线路出现故障；
    p (3) 用户操作不当；
    p (4) 用户通过非本公司授权的方式使用本软件服务；
    p (5) 其他本公司无法控制或合理预见的情形。
    p 3、您理解并同意，在使用本软件服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，本公司不对非本软件发布的任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：
    p (1) 来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；
    p (2) 因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；
    p (3) 其他因网络信息或用户行为引起的风险。
    p 4、您理解并同意，本公司提供的服务并非为某些特定目的（包括但不限于核设施、军事用途、医疗设施、交通通讯等重要领域）而设计，如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，本公司不承担法律责任。
    p 5、本公司依据本协议约定获得处理违法违规内容的权利，该权利不构成本公司的义务或承诺，本公司不能保证及时发现违法行为或进行相应处理。
    p 6、在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意本软件或其他部门发布的有关防范诈骗犯罪的提示。
  .article
    p 六、 服务的中止与终止
    p 1、 本公司可能会对提供的服务内容进行不定时的变更，也可能会中断、中止或终止服务。
    p 2、 如发生下列任何一种情形，本公司有权不经通知而中断或终止向您提供的服务：
    p (1) 根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；
    p (2) 您涉嫌违反相关法律法规规定；
    p (3) 按照法律规定或主管部门的要求；
    p (4) 出于安全的原因或其他必要的情形；
    p (5) 本协议中明确约定的其他情形。
  .article
    p 七、 法律适用与争议解决
    p 1、 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（仅为本协议之目的，不包括中国香港、台湾、澳门地区）。
    p 2、 若您和本公司之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地（即北京市朝阳区）有管辖权的人民法院诉讼解决。
    p 3、 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
    p 4、 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
</template>

<script>
export default {
  data() {
    return {}
  },
  methods: {},
  mounted() {},
}
</script>

<style lang="stylus" rel="stylesheet/stylus">
@import '../../styles/index.styl';
.agreement
  padding 10px 20px
  .title
    font-size 20px
    padding 15px 0
    line-height 28px
    color #3b8dd1
    font-weight 600
    border-bottom 1px solid #f0f0f0
    margin-bottom 15px
  .article
    font-size 14px
    white-space pre-wrap
    line-height 1.6
    margin-bottom 20px
    p
      line-height 1.6
</style>
